Revit 2027 API
ToggleButtonData(String, String, String, String) Constructor
Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ToggleButtonData(
	string name,
	string text,
	string assemblyName,
	string className
)
Public Sub New (
	name As String,
	text As String,
	assemblyName As String,
	className As String
)
public:
ToggleButtonData(
	String^ name,
	String^ text,
	String^ assemblyName,
	String^ className
)
new :
        name : string *
        text : string *
        assemblyName : string *
        className : string -> ToggleButtonData
Parameters
name String
The internal name of the new button.
text String
The user visible text seen on the new button.
assemblyName String
The assembly path of the button.
className String
The name of the class containing the implementation for the command.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is passed for one or more arguments.
ArgumentException | Thrown when an empty string is passed for one or more arguments.
See Also
Reference
ToggleButtonData Class
ToggleButtonData Overload
Autodesk.Revit.UI Namespace